ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_USBC.cpp
        case USB_STATE_DONE:
            usClientState->dataCallback = nullptr;
            break;

        case USB_STATE_STALL:
            LPC17_UsbClient_SetStallEP(0, 0);
            LPC17_UsbClient_SetStallEP(0, 1);
            break;

        case USB_STATE_CONFIGURATION:
            USB_HW_Configure(true);
            for (i = 1; i < 16; i++) {
                // direction in
                LPC17_UsbClient_ConfigEP(i, 1, 64);
                LPC17_UsbClient_EnableEP(i, 1);
                LPC17_UsbClient_ResetEP(i, 1);

                // direction out
                LPC17_UsbClient_ConfigEP(i, 0, 64);
                LPC17_UsbClient_EnableEP(i, 0);
                LPC17_UsbClient_ResetEP(i, 0);
            }

            break;

        }

        if (result != USB_STATE_STALL) {
            LPC17_UsbClient_ControlNext(usClientState);

            // If the port is configured, then output any possible withheld data
            if (result == USB_STATE_CONFIGURATION) {
                for (int32_t ep = 0; ep < LPC17_USB_ENDPOINT_COUNT; ep++) {
                    if (usClientState->isTxQueue[ep])
                        LPC17_UsbClient_StartOutput(usClientState, ep);
                }
            }
        }
    }
    else if (in) {
        // If previous packet has been sent and UDC is ready for more
        LPC17_UsbClient_ControlNext(usClientState);      // See if there is more to send

        if (LPC17_UsbClient_DeviceAddress & 0x80) {
            LPC17_UsbClient_DeviceAddress &= 0x7F;
            LPC17_UsbClient_SetAddress(LPC17_UsbClient_DeviceAddress);
        }
    }
}

void LPC17_UsbClient_Enpoint_TxInterruptHandler(UsClientState *usClientState, uint32_t endpoint) {
    uint32_t EP_INTR;
    int32_t val;

    if (USBEpIntSt & (1 << LPC17_UsbClient_EPAdr(endpoint, 1)))//done sending?
    {
        //clear interrupt flag
        USBEpIntClr = 1 << LPC17_UsbClient_EPAdr(endpoint, 1);
        while ((USBDevIntSt & CDFULL_INT) == 0);
        val = USBCmdData;

        // successfully transmitted packet, time to send the next one
        LPC17_UsbClient_TxPacket(usClientState, endpoint);
    }
}

void LPC17_UsbClient_Enpoint_RxInterruptHandler(UsClientState *usClientState, uint32_t endpoint) {
    bool          DisableRx;
    USB_PACKET64* Packet64 = TinyCLR_UsbClient_RxEnqueue(usClientState, endpoint, DisableRx);

    /* copy packet in, making sure that Packet64->Buffer is never overflowed */
    if (Packet64) {
        uint8_t   len = 0;//USB.UDCBCRx[EPno] & LPC17xx_USB::UDCBCR_mask;
        uint32_t* packetBuffer = (uint32_t*)Packet64->Buffer;
        len = LPC17_UsbClient_ReadEP(endpoint, Packet64->Buffer);

        // clear packet status
        nacking_rx_OUT_data[endpoint] = 0;
        Packet64->Size = len;
    }
    else {
        /* flow control should absolutely protect us from ever
        getting here, so if we do, it is a bug */
        nacking_rx_OUT_data[endpoint] = 1;//we will need to triger next interrupt
    }

}

void LPC17_UsbClient_SuspendEvent(UsClientState *usClientState) {
    // SUSPEND event only happened when Host(PC) set the device to SUSPEND
    // as there is always SOF every 1ms on the BUS to keep the device from
    // suspending. Therefore, the REMOTE wake up is not necessary at the ollie side
    usbDeviceDrivers[usClientState->controllerIndex].previousDeviceState = usClientState->deviceState;

    usClientState->deviceState = USB_DEVICE_STATE_SUSPENDED;

    TinyCLR_UsbClient_StateCallback(usClientState);
}


void LPC17_UsbClient_ResumeEvent(UsClientState *usClientState) {
    usClientState->deviceState = usbDeviceDrivers[usClientState->controllerIndex].previousDeviceState;

    TinyCLR_UsbClient_StateCallback(usClientState);
}

void LPC17_UsbClient_ResetEvent(UsClientState *usClientState) {
    LPC17_UsbClient_HardwareReset();
    LPC17_UsbClient_DeviceAddress = 0;

    // clear all flags
    TinyCLR_UsbClient_ClearEvent(usClientState, 0xFFFFFFFF);

    for (int32_t ep = 0; ep < LPC17_USB_ENDPOINT_COUNT; ep++) {
        usbDeviceDrivers[usClientState->controllerIndex].txRunning[ep] = false;
        usbDeviceDrivers[usClientState->controllerIndex].txNeedZLPS[ep] = false;
    }

    usClientState->deviceState = USB_DEVICE_STATE_DEFAULT;
    usClientState->address = 0;
    TinyCLR_UsbClient_StateCallback(usClientState);
}

bool LPC17_UsbClient_ProtectPins(int32_t controllerIndex, bool On) {
    UsClientState *usClientState = usbDeviceDrivers[controllerIndex].usClientState;

    DISABLE_INTERRUPTS_SCOPED(irq);

    if (usClientState) {
        if (On) {
            usClientState->deviceState = USB_DEVICE_STATE_ATTACHED;

            TinyCLR_UsbClient_StateCallback(usClientState);

            LPC17_UsbClient_StartHardware();
        }
        else {
            LPC17_UsbClient_HardwareReset();

            LPC17_UsbClient_DeviceAddress = 0;

            LPC17_UsbClient_StopHardware();
        }

        return true;
    }

    return false;
}

TinyCLR_Result TinyCLR_UsbClient_GetControllerCount(const TinyCLR_UsbClient_Controller* self, int32_t& count) {
    count = LPC17_TOTAL_USB_CONTROLLERS;

    return TinyCLR_Result::Success;
}

bool TinyCLR_UsbClient_Initialize(UsClientState* usClientState) {
    return LPC17_UsbClient_Initialize(usClientState);
}

bool TinyCLR_UsbClient_Uninitialize(UsClientState* usClientState) {
    return LPC17_UsbClient_Uninitialize(usClientState);
}

bool TinyCLR_UsbClient_StartOutput(UsClientState* usClientState, int32_t endpoint) {
    return LPC17_UsbClient_StartOutput(usClientState, endpoint);
}

bool TinyCLR_UsbClient_RxEnable(UsClientState* usClientState, int32_t endpoint) {
    return LPC17_UsbClient_RxEnable(usClientState, endpoint);
}

void TinyCLR_UsbClient_Delay(uint64_t microseconds) {
    LPC17_Time_Delay(nullptr, microseconds);
}

void TinyCLR_UsbClient_InitializeConfiguration(UsClientState *usClientState) {
    LPC17_UsbClient_InitializeConfiguration(usClientState);
}

uint32_t TinyCLR_UsbClient_GetEndpointSize(int32_t endpoint) {
    return endpoint == 0 ? LPC17_USB_ENDPOINT0_SIZE : LPC17_USB_ENDPOINT_SIZE;
}

